
//========================================================================================================================================================

let rule = "Еще не родился тот человек, который поставил бы цель, и не смог бы стать программистом.";

if(rule.length<25){
	rule = "rule1";
}else if(rule.length===25){
	rule ='rule2';
}else{
	rule ='rule3';
}
switch(rule) {
	case 'rule1':{
		console.log('все-таки нет правил без исключения');
		break;
	}		
	case 'rule2':
		{console.log("50 на 50");
		break;}
	case 'rule3':
		console.log('У меня 100 пудов все получится');
			break;
}